{
  "docs-filler-intro": "Con esta herramienta se puede cambiar el color de toda un área (que tenga el mismo color) con solo un toque. Su valor es `Tool.FILLER`.",
  "docs-filler-warning-alpha": "En caso de que el código de color posea un canal alpha, será ignorado para esta herramienta",
  "docs-filler-warning-multiple-touches": "Si el lienzo es tocado en múltiples puntos al mismo tiempo, se renderizará la acción del primero en ser detectado. En caso de que los toques sean progresivos, se renderizarán en orden cuando termine la acción anterior.",
  "docs-filler-warning-canvas-lock": "Se recomienda bloquear la interacción del lienzo mientras se ejecuta el rellenador para evitar errores.",
  "docs-filler-lock-tip": "[Se deberá implementar un método personalizado para bloquear el lienzo]",
  "docs-filler-info-toolsize": "toolSize no afectará al rellenador",
  "docs-filler-subtitle-animation": "Animando el Rellenador",
  "docs-filler-animation-description": "Por defecto el rellenador espera un momento (procesa) y aplica los cambios, sin embargo, este proceso puede hacerse visualmente más atractivo utilizando la *prop* **animatedFiller** (estableciendola a  `true`), esto provocará que se emplee una animación a partir del próximo toque, mostrando un efecto circular que se expande gradualmente.",
  "docs-filler-warning-animation-performance": "El uso de la animación, a pesar de ser visualmente atractivo, hará que el proceso sea más lento",
  "docs-filler-resolution-warning": "Para aumentar el rendimiento se recomienda disminuir la resolución",
  "docs-filler-subtitle-filling-event": "FillingEvent",
  "docs-filler-filling-event-description": "Cada vez que el rellenador comienza y termina una tarea emite un `FillingEvent`, el cual puede ser capturado a través de la *prop* **onFilling**. Cada `FillingEvent` posee las propiedades **target** (lienzo que desencadenó el evento), **isStarting**, **isEnding**, **x**, **y** y **color**.",
  "docs-filler-animation-support-warning": "La animación no es compatible con iOS 16.3 o inferior"
}
